<script setup>

</script>
 
<template>
<div>
    <div class="bg-[url('../assets/background/dormBackground.png')] bg-cover bg-center w-full h-screen flex flex-col items-center">
        <h1 class="pt-22 text-7xl font-noto-sans-thai font-bold drop-shadow-[4px_4px_1px_rgba(0,0,0,0.5)] text-white my-5">
            กฎระเบียบการเข้าพัก
        </h1>
        <div class="p-8 pr-5 w-9/12 h-8/12 mx-auto bg-white rounded-3xl border-[#9DB5B2] border-2 shadow-md font-noto-sans-thai flex flex-col">
            <div class="overflow-y-auto custom-scroll w-auto">
                <div class="text-[#1E555C] leading-8 font-medium text-lg pr-4">
                1. ห้ามส่งเสียงดังสร้างความรบกวน ก่อความรำคาญให้กับผู้พักอาศัยในหอพัก และห้ามทะเลาะวิวาทภายในหอพัก<br>
                2. ห้ามลักขโมยทรัพย์สิน หรือสิ่งของใดๆ ภายในหอพักหรือของผู้ที่พักอาศัยในหอพัก<br>
                3. ห้ามเสพอบายมุขภายในหอพัก เช่น บุหรี่ สุรา ยาเสพติด การพนัน ฯลฯ<br>
                4. ห้ามนำนักศึกษาหรือบุคคลภายนอกเข้าพักอาศัยในหอพักโดยไม่ได้รับอนุญาตจากอาจารย์ที่ปรึกษาหอพักและสำนักงานหอพักโดยเด็ดขาด หากฝ่าฝืนจะถูกตัดสิทธิการเข้าพักอาศัยในหอพัก<br>
                5. ไม่อนุญาตให้นำนักศึกษาหรือบุคคลภายนอกขึ้นหอพัก<br>
                6. นักศึกษาหรือบุคคลภายนอกที่เข้าพักชั่วคราวจะต้องออกจากหอพักไม่เกินเวลา 12.00 น. ของวันถัดไป<br>
                7. นักศึกษาต้องรักษาความสะอาดห้องพัก ของใช้ส่วนรวม และไม่วางสิ่งของไว้หน้าห้องพัก<br>
                8. ห้ามครอบครองวัตถุอันตราย อันจะนำมาซึ่งความเสียหายและเกิดอันตรายแก่ทรัพย์สินของหอพัก และผู้อาศัยในหอพัก เช่น อาวุธ วัตถุระเบิด แก๊ส เชื้อเพลิง ฯลฯ<br>
                9. ห้ามทำลายทรัพย์สินหอพัก เช่น รื้อถอน ดัดแปลง ต่อเติม เคลื่อนย้ายอุปกรณ์ ฯลฯ กรณีเจาะ-ตอกตะปูฝาผนัง ประตู เพดาน ฯลฯ จะถูกปรับจุดละ 300 บาท และหากทำทรัพย์สินเสียหายจะต้องชำระค่าปรับตามราคาของทรัพย์สินนั้น<br>
                10. ห้ามโยน ขว้างปา หรือทิ้งสิ่งของใดลงมาจากห้องพัก<br>
                11. ห้ามนำอุปกรณ์เครื่องใช้ไฟฟ้าที่ก่อให้เกิดอันตรายได้ง่ายมาใช้ในห้องพัก เช่น ขดลวดต้มน้ำ เตา ไฟฟ้า (Hot Plate) ฯลฯ<br>
                12. ห้ามประกอบอาหารในหอพัก และห้ามนำภาชนะของร้านค้าขึ้นหอพัก<br>
                13. ห้ามตากผ้าและวางพาดสิ่งของต่างๆ บนขอบระเบียงหลังห้องพัก<br>
                14. ห้ามนำสัตว์เลี้ยงทุกชนิดมาเลี้ยงไว้ในบริเวณหอพัก / ห้องพัก<br>
                15. ห้ามนักศึกษานอนค้างคืนภายนอกหอพัก ก่อนได้รับอนุญาตจากอาจารย์ที่ปรึกษาหอพัก ทั้งนี้ นักศึกษาชายและหญิงจะต้องกลับเข้าหอพักภายในเวลา 24.00 น.<br>
                16. นักศึกษาจะต้องไม่ฝ่าฝืนคำสั่งและคำตักเตือนของอาจารย์ที่ปรึกษาหอพัก กรรมการนักศึกษาหอพัก และเจ้าหน้าที่หอพัก รวมทั้งจะต้องไม่ประพฤติผิดวินัยนักศึกษาตามข้อบังคับของมหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี ว่าด้วยวินัยนักศึกษา<br>
                17. นักศึกษาต้องไม่ฝ่าฝืนกฎระเบียบอื่นๆ ของหอพัก<br>
                <span class="text-[#E09F3E]">*หากนักศึกษามีความจำเป็นต้องกลับเข้าหอพักนักศึกษาหลังเวลาปิดหอพักหรือต้องออกจากหอพักนักศึกษาก่อนเวลาเปิดหอพัก สามารถติดต่อขออนุญาตที่สำนักงานหอพัก ล่วงหน้าอย่างน้อย 1 วัน</span>
            </div>
            </div>
        </div>
    </div>
</div>
</template>
<style scoped>
    .custom-scroll {
        scrollbar-width: large;
        scrollbar-color: #9DB5B2 #f1f1f1;
    }
</style>